
--ConfigTxtTip

local m = {
	LTKey_AppName = "人人安徽麻将!",
	LTKey_CopySuccess = "复制成功",
	LTKey_ReLogin = "您确定要重新登录游戏吗?",
	LTKey_ConnectRefused = "连不上服务器啊,服务器挂了吧,呵呵-？！？",

	LTKey_0001 = "正在返回游戏，请稍等！",
	LTKey_0002 = "当前网络不稳定，请重试！",
	LTKey_0003 = "正在登录游戏...",
	LTKey_0004 = "8局%d 16局%d",
	LTKey_0005 = "正在创建房间...",
	LTKey_0006 = "正在进入房间...",
	LTKey_0007 = "提示",
	LTKey_0008 = "亲爱的玩家，建议您选择微信登录。游客模式下的游戏数据在更换设备时将无法找回，确定登录吗？",
	LTKey_0009 = "返回大厅",
	LTKey_0010 = "返回大厅房间仍会保留，快去邀请大伙来玩吧~",
	LTKey_0011 = "解散房间",
	LTKey_0012 = "解散房间不扣房卡，是否确定解散？",
	LTKey_0012_1 = "是否确定解散？",
	LTKey_0013 = "房间号\n%d",
	LTKey_0014 = "您的网络状态不稳定，请检查手机网络状态!",
	LTKey_0015 = "房间号不存在，请重新输入！",
	LTKey_0016 = "正在返回大厅！",
	LTKey_0017 = "请输入用户名！",
	LTKey_0018 = "房间人数已满！",
	LTKey_0019 = "您确定要退出房间么？",
	LTKey_0020 = "申请解散房间",
	LTKey_0021 = "【%s】申请解散房间，是否同意？",
	LTKey_0022 = "玩家【%s】申请解散房间，请问是否同意？(超过%s秒，默认同意解散)\n",
	LTKey_0023 = "玩家【%s】申请解散房间，请等待其他玩家同意 (超过%s秒，默认同意解散)\n",
	LTKey_0024 = "【%s】等待选择\n",
	LTKey_0025 = "【%s】同意\n",
	LTKey_0026 = "玩家【%s】拒绝，房间解散失败，游戏继续",
	LTKey_0027 = "玩家【%s】，【%s】，【%s】同意，房间已解散",
	LTKey_0027_1 = "玩家【%s】，【%s】同意，房间已解散",
	LTKey_0027_2 = "玩家【%s】，同意，房间已解散",
	
	LTKey_0028_1 = "你太牛了！",
	LTKey_0028_2 = "哈哈，手气真好！",
	LTKey_0028_3 = "快点出牌啊！",
	LTKey_0028_4 = "今天真高兴",
	LTKey_0028_5 = "这个吃得好",
	LTKey_0028_6 = "你放炮，我不胡",
	LTKey_0028_7 = "你家里是开银行的吧？",
	LTKey_0028_8 = "不好意思，我有事要先走一步了",
	LTKey_0028_9 = "你的牌打得太好了",
	LTKey_0028_10 = "大家好，很高兴见到各位",
	LTKey_0028_11 = "怎么又断线了？网络怎么这么差啊！",

	LTKey_0029 = "第一次登陆送8局房卡5张",
	LTKey_0029_1 = "祝您玩的开心！",
	LTKey_0030 = "微信失效了，重新登录一下！",
	LTKey_0031 = "先安装微信吧！",
	LTKey_0032 = "检测中...",
	LTKey_0033 = "准备加载...",
	LTKey_0034 = "加载失败了...",
	LTKey_0035 = "加载失败了...",
	LTKey_0036 = "努力加载中%s: %d",
	LTKey_0037 = "加载资源%s:%s失败,请检查您的网络并尝试重启游戏!",
	LTKey_0038 = "加载成功!",
	LTKey_0039 = "%d号房间",
	LTKey_0040 = "对战时间:%d-%d-%d %d:%d:%d",
	LTKey_0041 = "请确认并同意用户协议！",
	LTKey_0043 = "您确定不胡吗？",
	LTKey_0044 = "时间到，解散房间成功！",
	LTKey_0045 = "返回大厅失败！",
	LTKey_0046 = "房卡不足,%s！",
	LTKey_0047 = "连接超时,尝试重新连接服务器！",
	LTKey_0048 = "欢迎来到人人安徽麻将！",
	LTKey_0060 = "正在加载...",
	LTKey_0061 = "游戏需要更新,请稍等片刻!",
	LTKey_0062 = "看牌看牌，看你妹",
	LTKey_0063 = "冷静，冲动是魔鬼",
	LTKey_0064 = "小手一抖，锅底拿走",
	LTKey_0065 = "人生难得几叵搏，搏一搏，单车变摩托",
	LTKey_0066 = "牌实在太烂了" ,
	LTKey_0067 = "今天运气不错",
	LTKey_0068 = "快点吧，我等的花儿都谢了!" ,
	LTKey_0069 = "莫投机，投机必被抓" ,
	LTKey_0070 = "还能不能愉快的玩耍了",
	LTKey_0071 = "来来来，不信邪你就上",
	LTKey_0072 = "跟到底，打锅底，玩的才刺激" ,
	LTKey_0082 = "您已加入了房间",
	LTKey_0083 = "房间已开始",
	LTKey_0084 = "加入比赛场",
	LTKey_0085 = "成为推广员即可使用",

	LTKey_0038 = "敬请期待!",
}

function m.GetConfigTxt(key,...)
	if ("string" ~= type(key)) then
		return "nil";
	end

	local ltString = m[key] or key;
	if( _G.next({...}) ) then
		ltString = string.format(ltString, ...)
	end

	return ltString
end

return m
